Vidith-hundekar/freebsd-src-GSOC/share/man/man4/bootcount.4
.\" Copyright (c) 2026 Bruce Simpson.
.\" Copyright (c) 2026 Vidith Hundekar.
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd August 28, 2026
.Dt BOOTCOUNT 4
.Os
.Sh NAME
.Nm bootcount
.Nd persistent boot counter for early-boot anti-replay protection
.Sh SYNOPSIS
No kernel configuration options are required; this facility is
compiled in unconditionally.
.Sh DESCRIPTION
The
.Nm
facility provides a value, unique per boot, for use by early-boot
networking protocols
.Pq e.g. WireGuard, SCTP
that must compute HMAC or similar authentication tags before the
system entropy pool has been fully seeded.
Mixing this value into such computations prevents replay of a
captured authentication tag from one boot against a later boot.
.Pp
The value is exposed via two read-only
.Xr sysctl 8
nodes:
.Bd -literal
kern.bootcount: 472446402570
kern.bootcount_fw_backed: 1
.Ed
.Pp
The output nodes are defined as follows:
.Bl -inset
.It Va kern.bootcount
is a
.Vt uint64_t
value, guaranteed to differ between any two boots of the system.
This value is write-once per boot; once set, further writes are
rejected with
.Er EPERM
until the next reboot.
.It Va kern.bootcount_fw_backed
is a boolean indicating whether
.Va kern.bootcount
was sourced from UEFI firmware
.Pq Dq firmware-backed ,
the stronger source, or from the non-UEFI fallback described below.
.El
.Pp
On systems with UEFI firmware, the boot loader captures the UEFI
monotonic counter via
.Fn BS->GetNextMonotonicCount
during Boot Services, and the kernel additionally consults
.Fn RS->GetNextHighMonotonicCount
as a fallback.
This value originates in firmware NVRAM, outside the reach of the
running operating system, and cannot be forged or rolled back by
software running on the installed system.
.Pp
On systems without UEFI, a persistent counter is instead maintained
at
.Pa /var/db/bootcount
by the
.Xr rc 8
script
.Pa /etc/rc.d/bootcount ,
protected with the
.Dv SF_IMMUTABLE
.Pq Dq schg
flag via
.Xr chflags 1 .
This script is disabled by default and must be enabled explicitly
via
.Ic bootcount_enable
in
.Xr rc.conf 5 :
.Bd -literal -offset indent
bootcount_enable="YES"
.Ed
.Sh SEE ALSO
.Xr chflags 1 ,
.Xr logger 1 ,
.Xr security 7 ,
.Xr rc 8 ,
.Xr sysctl 8 ,
.Xr kern_bootcount 9
.Sh HISTORY
The
.Nm
facility was implemented as part of a Google Summer of Code 2026
project.
.Sh AUTHORS
.An Vidith Hundekar Aq Mt hundekarvidith@gmail.com
.Sh SECURITY CONSIDERATIONS
.Sy This is not a security guarantee ;
enforcement requires
.Xr security 7
level above 0, so
.Va kern.bootcount
should be treated as trustworthy only when
.Va kern.bootcount_fw_backed
is true.
If a raised securelevel prevents the script from updating the file,
the failure is logged via
.Xr logger 1
rather than passing silently.
