Vidith-hundekar/freebsd-src-GSOC/share/man/man9/kern_bootcount.9
.\" Copyright (c) 2026 Vidith Hundekar
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 31, 2026
.Dt KERN_BOOTCOUNT 9
.Os
.Sh NAME
.Nm kern_get_bootcount ,
.Nm kern_bootcount_is_fw_backed
.Nd retrieve the current boot's anti-replay counter value
.Sh SYNOPSIS
.In sys/bootcount.h
.Ft uint64_t
.Fn kern_get_bootcount void
.Ft bool
.Fn kern_bootcount_is_fw_backed void
.Sh DESCRIPTION
The
.Fn kern_get_bootcount
function returns the value of
.Va kern.bootcount ,
a
.Vt uint64_t
guaranteed to differ between any two boots of the system; see
.Xr bootcount 4
for the underlying counter and its trust model.
.Pp
The
.Fn kern_bootcount_is_fw_backed
function reports whether that value is firmware-backed.
Consumers requiring a genuine anti-forgery guarantee, such as
mixing the counter into an early-boot HMAC, should check this
before trusting the return value of
.Fn kern_get_bootcount .
.Pp
Both values are populated by
.Xr SYSINIT 9
at
.Dv SI_SUB_KMEM
and are safe to call from any context after that point.
Calling either function before this SYSINIT stage has run returns
zero or
.Dv false
respectively.
.Sh EXAMPLES
.Bd -literal -offset indent
if (kern_bootcount_is_fw_backed()) {
	uint64_t bc = kern_get_bootcount();
	HMAC_Update(&ctx, (uint8_t *)&bc, sizeof(bc));
}
.Ed
.Sh SEE ALSO
.Xr bootcount 4 ,
.Xr SYSINIT 9
.Sh HISTORY
The
.Nm kern_get_bootcount
facility was implemented as part of a Google Summer of Code 2026
project.
.Sh AUTHORS
.An Vidith Hundekar Aq Mt hundekarvidith@gmail.com